import json
import pprint


text0 = [1, 1,
         1, 1, ]
text1 = [1, 1,
         1, 1, ]
for i in range(4):
    text0[i] = [f'{i}'] * 7  # type: ignore #   пустой массив 4х7
    text1[i] = [f'{i}'] * 7  # type: ignore

#   pprint.pprint(text)
# Чтение расписания из файлов и заполнение массива
fls = [11, 12, 21, 22]
i = 0
for i in range(4):
    for j in range(7):
        f = open(f'data/{fls[i]}/{j + 1}.txt', 'r', encoding="utf-8")
        text0[i][j] = f.read()  # type: ignore
        #   print(f'i={i} j={j} file={text0[i][j]}')
        f.close()
        f = open(f'data/{fls[i]}/{j + 1}1.txt', 'r', encoding="utf-8")
        text1[i][j] = f.read()  # type: ignore
        #   print(f'i={i} j={j} file={text1[i][j]}')
        f.close()

pprint.pprint(text0)
pprint.pprint(text1)


data = {
    -1: '0-ftf-is,1-uf-1903',
    0: {
            0:  {0: 'Понедельник ИС-1.1\nЧислитель', 1: 'Вторник ИС-1.1\nЧислитель', 2: 'Среда ИС-1.1\nЧислитель',
                 3: 'Четверг ИС-1.1\nЧислитель', 4: 'Пятница ИС-1.1\nЧислитель', 5: 'Суббота ИС-1.1\nЧислитель',
                 6: 'Воскресенье ИС-1.1\nЧислитель', },
            1:  {0: 'Понедельник ИС-1.1\nЗнаменатель', 1: 'Вторник ИС-1.1\nЗнаменатель', 2: 'Среда ИС-1.1\nЗнаменатель',
                 3: 'Четверг ИС-1.1\nЗнаменатель', 4: 'Пятница ИС-1.1\nЗнаменатель', 5: 'Суббота ИС-1.1\nЗнаменатель',
                 6: 'Воскресенье ИС-1.1\nЗнаменатель', }
            },
    1: {
            0: {0: text0[1][0], 1: text0[1][1], 2: text0[1][2],
                3: text0[1][3], 4: text0[1][4], 5: text0[1][5],
                6: text0[1][6], },
            1: {0: text1[1][0], 1: text1[1][1], 2: text1[1][2],
                3: text1[1][3], 4: text1[1][4], 5: text1[1][5],
                6: text1[1][6], }
            },
    2: {
            0:  {0: text0[2][0], 1: text0[2][1], 2: text0[2][2],
                 3: text0[2][3], 4: text0[2][4], 5: text0[2][5],
                 6: text0[2][6], },
            1:  {0: text1[2][0], 1: text1[2][1], 2: text1[2][2],
                 3: text1[2][3], 4: text1[2][4], 5: text1[2][5],
                 6: text1[2][6], }
            },
    3: {
            0: {0: text0[3][0], 1: text0[3][1], 2: text0[3][2],
                3: text0[3][3], 4: text0[3][4], 5: text0[3][5],
                6: text0[3][6], },
            1: {0: text1[3][0], 1: text1[3][1], 2: text1[3][2],
                3: text1[3][3], 4: text1[3][4], 5: text1[3][5],
                6: text1[3][6], }
        },
    4: {
            0:  {0: '0Понедельник Юф1903', 1: '0Вторник Юф1903', 2: '0Среда Юф1903',
                 3: '0Четверг Юф1903', 4: '0Пятница Юф1903', 5: '0Суббота Юф1903',
                 6: '0Воскресенье Юф1903', },
            1:  {0: '1Понедельник Юф1903', 1: '1Вторник Юф1903', 2: '1Среда Юф1903',
                 3: '1Четверг Юф1903', 4: '1Пятница Юф1903', 5: '1Суббота Юф1903',
                 6: '1Воскресенье Юф1903', }
            }
        }


with open("data/data_file.json", "w") as write_file:
    json.dump(data, write_file)
